<a href="https://colab.research.google.com/github/gitmystuff/INFO4080/blob/main/Week_13-The_Abstract/Week_13_In_Class_Activity.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Week 12: In-Class Activity

Your Name

## Getting Started

* Colab - get notebook from gitmystuff DTSC4080 repository
* Save a Copy in Drive
* Remove Copy of
* Edit your name
* Attendance
* Clean up Colab Notebooks folder
* Submit shared link

## Bayesian Analysis

* Bayes' Theorem Notebook

## SQL

### Public Data

* https://data.census.gov/
* https://healthdata.gov/
* Edgar: https://www.sec.gov/edgar
* Bureau of Justice: https://bjs.ojp.gov/
* IRS: https://www.irs.gov/statistics
* Bureau of Economic Analysis: https://www.bea.gov/
* Federal Reserve: https://www.federalreserve.gov/data.htm
* DOE Data and Research: https://www2.ed.gov/rschstat/landing.jhtml?src=ft
* Bureau of Labor Statistics: https://www.bls.gov/
* US Patent and Trademark Office: https://www.uspto.gov/
* National Centers for Environmental Information: https://www.ncei.noaa.gov/
* World Bank: https://data.worldbank.org/
* CIA World Factbook: https://www.cia.gov/the-world-factbook/
* United Nations: https://data.un.org/
* UNICEF: https://data.unicef.org/
* Statistics Canada: https://www.statcan.gc.ca/
* Eurostat: https://ec.europa.eu/eurostat
* Organization for Economic Cooperation and Development: https://data.oecd.org/
* UK National Health Service NHS Digital: https://digital.nhs.uk/
* Google Finance: https://www.google.com/finance/
* Google Trends: https://trends.google.com/trends/
* Google Public Data Explorer: https://www.google.com/publicdata/directory
* Amazon Web Services Public Data: https://registry.opendata.aws/
* Data.gov: https://data.gov/
* Google Ngram Viewer: https://books.google.com/ngrams/
* The Corpus of Contemporary American English: https://www.english-corpora.org/coca/
* University of California, Irvine, Center for Machine Learning: https://archive.ics.uci.edu/
* Pew Research Center: https://www.pewresearch.org/
* https://www.linkedin.com/learning/learning-public-data-sets-2/bureau-of-labor-statistics?resume=false&u=74650474

### BigQuery

* https://console.cloud.google.com/marketplace/product/google/bigquery.googleapis.com?_ga=2.211298837.1868925152.1707340152-1299486709.1704991752&project=studynotes-prod&returnUrl=%2Fbigquery%3F_ga%3D2.211298837.1868925152.1707340152-1299486709.1704991752%26project%3Dstudynotes-prod

<pre>
SELECT
  *
FROM
  `bigquery-public-data.usa_names.usa_1910_current`
LIMIT 100
</pre>

<pre>
SELECT
  *
FROM
  `bigquery-public-data.usa_names.usa_1910_current`
WHERE
  state = 'TX'
LIMIT 100
</pre>

<pre>
SELECT
  MIN(year), MAX(year)
FROM
  `bigquery-public-data.usa_names.usa_1910_current`
</pre>

<pre>
SELECT
  name, COUNT(name) as cnt
FROM
  `bigquery-public-data.usa_names.usa_1910_current`
GROUP BY name
ORDER BY cnt DESC
LIMIT 1
</pre>

<pre>
SELECT
  *
FROM
  `bigquery-public-data.usa_names.usa_1910_current`
WHERE
  state = 'TX'
AND
  year = 2020
LIMIT 100
</pre>

Public Datasets

* Add
* Search for public datasets
* Search of World Bank

World Bank
* https://databank.worldbank.org/metadataglossary/jobs/series/SI.POV.GINI

<pre>

SELECT acs.geo_id, acs.total_pop, fips.state_name
FROM
`bigquery-public-data.census_bureau_acs.state_2010_1yr` as acs,
`bigquery-public-data.census_utility.fips_codes_states` as fips
WHERE acs.geo_id = fips.state_fips_code
AND fips.state_name = 'Texas'

</pre>

<pre>
SELECT *
FROM `bigquery-public-data.census_bureau_acs.state_2010_1yr` as acs
INNER JOIN  `bigquery-public-data.census_utility.fips_codes_states` as fips
ON acs.geo_id = fips.state_fips_code
</pre>

### SQL Notebook

### Setting Up Databases

* https://www3.ntu.edu.sg/home/ehchua/programming/sql/SampleDatabases.html
* https://learnsql.com/blog/free-online-datasets-to-practice-sql/
* https://realpython.com/python-sql-libraries/

In [ ]:
import sqlite3
from sqlite3 import Error

def create_connection(path):
    connection = None
    try:
        connection = sqlite3.connect(path)
        print("Connection to SQLite DB successful")
    except Error as e:
        print(f"The error '{e}' occurred")

    return connection

In [ ]:
connection = create_connection("sm_app.sqlite")

Connection to SQLite DB successful

In [ ]:
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query executed successfully")
    except Error as e:
        print(f"The error '{e}' occurred")

In [ ]:
create_users_table = """
CREATE TABLE IF NOT EXISTS users (
  id INTEGER PRIMARY KEY AUTOINCREMENT,
  name TEXT NOT NULL,
  age INTEGER,
  gender TEXT,
  nationality TEXT
);
"""

create_posts_table = """
CREATE TABLE IF NOT EXISTS posts(
  id INTEGER PRIMARY KEY AUTOINCREMENT,
  title TEXT NOT NULL,
  description TEXT NOT NULL,
  user_id INTEGER NOT NULL,
  FOREIGN KEY (user_id) REFERENCES users (id)
);
"""

create_comments_table = """
CREATE TABLE IF NOT EXISTS comments (
  id INTEGER PRIMARY KEY AUTOINCREMENT,
  text TEXT NOT NULL,
  user_id INTEGER NOT NULL,
  post_id INTEGER NOT NULL,
  FOREIGN KEY (user_id) REFERENCES users (id) FOREIGN KEY (post_id) REFERENCES posts (id)
);
"""

create_likes_table = """
CREATE TABLE IF NOT EXISTS likes (
  id INTEGER PRIMARY KEY AUTOINCREMENT,
  user_id INTEGER NOT NULL,
  post_id integer NOT NULL,
  FOREIGN KEY (user_id) REFERENCES users (id) FOREIGN KEY (post_id) REFERENCES posts (id)
);
"""

execute_query(connection, create_users_table)
execute_query(connection, create_posts_table)
execute_query(connection, create_comments_table)
execute_query(connection, create_likes_table)

Query executed successfully
Query executed successfully
Query executed successfully
Query executed successfully

### CRUD

In [ ]:
create_users = """
INSERT INTO
  users (name, age, gender, nationality)
VALUES
  ('James', 25, 'male', 'USA'),
  ('Leila', 32, 'female', 'France'),
  ('Brigitte', 35, 'female', 'England'),
  ('Mike', 40, 'male', 'Denmark'),
  ('Elizabeth', 21, 'female', 'Canada');
"""

execute_query(connection, create_users)

Query executed successfully

In [ ]:
create_posts = """
INSERT INTO
  posts (title, description, user_id)
VALUES
  ("Happy", "I am feeling very happy today", 1),
  ("Hot Weather", "The weather is very hot today", 2),
  ("Help", "I need some help with my work", 2),
  ("Great News", "I am getting married", 1),
  ("Interesting Game", "It was a fantastic game of tennis", 5),
  ("Party", "Anyone up for a late-night party today?", 3);
"""

execute_query(connection, create_posts)

Query executed successfully

In [ ]:
create_comments = """
INSERT INTO
  comments (text, user_id, post_id)
VALUES
  ('Count me in', 1, 6),
  ('What sort of help?', 5, 3),
  ('Congrats buddy', 2, 4),
  ('I was rooting for Nadal though', 4, 5),
  ('Help with your thesis?', 2, 3),
  ('Many congratulations', 5, 4);
"""

create_likes = """
INSERT INTO
  likes (user_id, post_id)
VALUES
  (1, 6),
  (2, 3),
  (1, 5),
  (5, 4),
  (2, 4),
  (4, 2),
  (3, 6);
"""

execute_query(connection, create_comments)
execute_query(connection, create_likes)

Query executed successfully
Query executed successfully

In [ ]:
def execute_read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as e:
        print(f"The error '{e}' occurred")

In [ ]:
select_users = "SELECT * from users"
users = execute_read_query(connection, select_users)

for user in users:
    print(user)

(1, 'James', 25, 'male', 'USA')
(2, 'Leila', 32, 'female', 'France')
(3, 'Brigitte', 35, 'female', 'England')
(4, 'Mike', 40, 'male', 'Denmark')
(5, 'Elizabeth', 21, 'female', 'Canada')

In [ ]:
select_posts = "SELECT * FROM posts"
posts = execute_read_query(connection, select_posts)

for post in posts:
    print(post)

(1, 'Happy', 'I am feeling very happy today', 1)
(2, 'Hot Weather', 'The weather is very hot today', 2)
(3, 'Help', 'I need some help with my work', 2)
(4, 'Great News', 'I am getting married', 1)
(5, 'Interesting Game', 'It was a fantastic game of tennis', 5)
(6, 'Party', 'Anyone up for a late-night party today?', 3)

In [ ]:
select_users_posts = """
SELECT
  users.id,
  users.name,
  posts.description
FROM
  posts
  INNER JOIN users ON users.id = posts.user_id
"""

users_posts = execute_read_query(connection, select_users_posts)

for users_post in users_posts:
    print(users_post)

(1, 'James', 'I am feeling very happy today')
(2, 'Leila', 'The weather is very hot today')
(2, 'Leila', 'I need some help with my work')
(1, 'James', 'I am getting married')
(5, 'Elizabeth', 'It was a fantastic game of tennis')
(3, 'Brigitte', 'Anyone up for a late-night party today?')

In [ ]:
select_posts_comments_users = """
SELECT
  posts.description as post,
  text as comment,
  name
FROM
  posts
  INNER JOIN comments ON posts.id = comments.post_id
  INNER JOIN users ON users.id = comments.user_id
"""

posts_comments_users = execute_read_query(
    connection, select_posts_comments_users
)

for posts_comments_user in posts_comments_users:
    print(posts_comments_user)

('Anyone up for a late-night party today?', 'Count me in', 'James')
('I need some help with my work', 'What sort of help?', 'Elizabeth')
('I am getting married', 'Congrats buddy', 'Leila')
('It was a fantastic game of tennis', 'I was rooting for Nadal though', 'Mike')
('I need some help with my work', 'Help with your thesis?', 'Leila')
('I am getting married', 'Many congratulations', 'Elizabeth')

In [ ]:
select_post_description = "SELECT description FROM posts WHERE id = 2"

post_description = execute_read_query(connection, select_post_description)

for description in post_description:
    print(description)

('The weather is very hot today',)

In [ ]:
update_post_description = """
UPDATE
  posts
SET
  description = "The weather has become pleasant now"
WHERE
  id = 2
"""

execute_query(connection, update_post_description)

Query executed successfully

In [ ]:
select_post_description = "SELECT description FROM posts WHERE id = 2"

post_description = execute_read_query(connection, select_post_description)

for description in post_description:
    print(description)

('The weather has become pleasant now',)

In [ ]:
select_posts = "SELECT * FROM comments"
posts = execute_read_query(connection, select_posts)

for post in posts:
    print(post)

(1, 'Count me in', 1, 6)
(2, 'What sort of help?', 5, 3)
(3, 'Congrats buddy', 2, 4)
(4, 'I was rooting for Nadal though', 4, 5)
(5, 'Help with your thesis?', 2, 3)
(6, 'Many congratulations', 5, 4)

In [ ]:
delete_comment = "DELETE FROM comments WHERE id = 5"
execute_query(connection, delete_comment)

Query executed successfully

In [ ]:
select_posts = "SELECT * FROM comments"
posts = execute_read_query(connection, select_posts)

for post in posts:
    print(post)

(1, 'Count me in', 1, 6)
(2, 'What sort of help?', 5, 3)
(3, 'Congrats buddy', 2, 4)
(4, 'I was rooting for Nadal though', 4, 5)
(6, 'Many congratulations', 5, 4)

### Aggregate Functions

* Aggregate Functions -  https://www.simplilearn.com/tutorials/sql-tutorial/sql-aggregate-functions

In [ ]:
select_posts = "SELECT MIN(post_id), MAX(user_id) FROM comments"
agg = execute_read_query(connection, select_posts)

agg

[(3, 5)]

### MySQL to SQLite

* https://www3.ntu.edu.sg/home/ehchua/programming/sql/SampleDatabases.html
* https://dev.mysql.com/doc/employee/en/employees-installation.html
* https://github.com/datacharmer/test_db
* https://dev.mysql.com/doc/employee/en/sakila-structure.html

In [ ]:
# load sql and use sqlite as our database
%load_ext sql
%sql sqlite://

In [ ]:
%%sql
CREATE TABLE IF NOT EXISTS employees (
    emp_no      INT             NOT NULL,
    birth_date  DATE            NOT NULL,
    first_name  VARCHAR(14)     NOT NULL,
    last_name   VARCHAR(16)     NOT NULL,
    gender      CHAR(4)         NOT NULL,
    hire_date   DATE            NOT NULL,
    PRIMARY KEY (emp_no)
);

CREATE TABLE IF NOT EXISTS departments (
    dept_no     CHAR(4)         NOT NULL,
    dept_name   VARCHAR(40)     NOT NULL,
    PRIMARY KEY (dept_no)
);

CREATE TABLE IF NOT EXISTS dept_manager (
   emp_no       INT             NOT NULL,
   dept_no      CHAR(4)         NOT NULL,
   from_date    DATE            NOT NULL,
   to_date      DATE            NOT NULL,
   FOREIGN KEY (emp_no)  REFERENCES employees (emp_no)    ON DELETE CASCADE,
   FOREIGN KEY (dept_no) REFERENCES departments (dept_no) ON DELETE CASCADE,
   PRIMARY KEY (emp_no,dept_no)
);

CREATE TABLE IF NOT EXISTS dept_emp (
    emp_no      INT             NOT NULL,
    dept_no     CHAR(4)         NOT NULL,
    from_date   DATE            NOT NULL,
    to_date     DATE            NOT NULL,
    FOREIGN KEY (emp_no)  REFERENCES employees   (emp_no)  ON DELETE CASCADE,
    FOREIGN KEY (dept_no) REFERENCES departments (dept_no) ON DELETE CASCADE,
    PRIMARY KEY (emp_no,dept_no)
);

CREATE TABLE IF NOT EXISTS titles (
    emp_no      INT             NOT NULL,
    title       VARCHAR(50)     NOT NULL,
    from_date   DATE            NOT NULL,
    to_date     DATE,
    FOREIGN KEY (emp_no) REFERENCES employees (emp_no) ON DELETE CASCADE,
    PRIMARY KEY (emp_no,title, from_date)
)
;

CREATE TABLE IF NOT EXISTS salaries (
    emp_no      INT             NOT NULL,
    salary      INT             NOT NULL,
    from_date   DATE            NOT NULL,
    to_date     DATE            NOT NULL,
    FOREIGN KEY (emp_no) REFERENCES employees (emp_no) ON DELETE CASCADE,
    PRIMARY KEY (emp_no, from_date)
)
;

CREATE VIEW IF NOT EXISTS dept_emp_latest_date AS
    SELECT emp_no, MAX(from_date) AS from_date, MAX(to_date) AS to_date
    FROM dept_emp
    GROUP BY emp_no;

CREATE VIEW IF NOT EXISTS current_dept_emp AS
    SELECT l.emp_no, dept_no, l.from_date, l.to_date
    FROM dept_emp d
        INNER JOIN dept_emp_latest_date l
        ON d.emp_no=l.emp_no AND d.from_date=l.from_date AND l.to_date = d.to_date;

 * sqlite://
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [ ]:
%%sql
SELECT * FROM sqlite_master;

 * sqlite://
Done.

[('table', 'employees', 'employees', 2, 'CREATE TABLE employees (\n    emp_no      INT             NOT NULL,\n    birth_date  DATE            NOT NULL,\n    first_name  VARCHAR(14)     NOT N ... (13 characters truncated) ... t_name   VARCHAR(16)     NOT NULL,\n    gender      CHAR(4)         NOT NULL,\n    hire_date   DATE            NOT NULL,\n    PRIMARY KEY (emp_no)\n)'),
 ('index', 'sqlite_autoindex_employees_1', 'employees', 3, None),
 ('table', 'departments', 'departments', 4, 'CREATE TABLE departments (\n    dept_no     CHAR(4)         NOT NULL,\n    dept_name   VARCHAR(40)     NOT NULL,\n    PRIMARY KEY (dept_no)\n)'),
 ('index', 'sqlite_autoindex_departments_1', 'departments', 5, None),
 ('table', 'dept_manager', 'dept_manager', 6, 'CREATE TABLE dept_manager (\n   emp_no       INT             NOT NULL,\n   dept_no      CHAR(4)         NOT NULL,\n   from_date    DATE            NO ... (93 characters truncated) ... yees (emp_no)    ON DELETE CASCADE,\n   FOREIGN KEY (dept_no) REFERENCES departments (dept_no) ON DELETE CASCADE,\n   PRIMARY KEY (emp_no,dept_no)\n)'),
 ('index', 'sqlite_autoindex_dept_manager_1', 'dept_manager', 7, None),
 ('table', 'dept_emp', 'dept_emp', 8, 'CREATE TABLE dept_emp (\n    emp_no      INT             NOT NULL,\n    dept_no     CHAR(4)         NOT NULL,\n    from_date   DATE            NOT NU ... (92 characters truncated) ... es   (emp_no)  ON DELETE CASCADE,\n    FOREIGN KEY (dept_no) REFERENCES departments (dept_no) ON DELETE CASCADE,\n    PRIMARY KEY (emp_no,dept_no)\n)'),
 ('index', 'sqlite_autoindex_dept_emp_1', 'dept_emp', 9, None),
 ('table', 'titles', 'titles', 10, 'CREATE TABLE titles (\n    emp_no      INT             NOT NULL,\n    title       VARCHAR(50)     NOT NULL,\n    from_date   DATE            NOT NULL,\n    to_date     DATE,\n    FOREIGN KEY (emp_no) REFERENCES employees (emp_no) ON DELETE CASCADE,\n    PRIMARY KEY (emp_no,title, from_date)\n)'),
 ('index', 'sqlite_autoindex_titles_1', 'titles', 11, None),
 ('table', 'salaries', 'salaries', 12, 'CREATE TABLE salaries (\n    emp_no      INT             NOT NULL,\n    salary      INT             NOT NULL,\n    from_date   DATE            NOT NU ... (12 characters truncated) ... date     DATE            NOT NULL,\n    FOREIGN KEY (emp_no) REFERENCES employees (emp_no) ON DELETE CASCADE,\n    PRIMARY KEY (emp_no, from_date)\n)'),
 ('index', 'sqlite_autoindex_salaries_1', 'salaries', 13, None),
 ('view', 'dept_emp_latest_date', 'dept_emp_latest_date', 0, 'CREATE VIEW dept_emp_latest_date AS\n    SELECT emp_no, MAX(from_date) AS from_date, MAX(to_date) AS to_date\n    FROM dept_emp\n    GROUP BY emp_no'),
 ('view', 'current_dept_emp', 'current_dept_emp', 0, 'CREATE VIEW current_dept_emp AS\n    SELECT l.emp_no, dept_no, l.from_date, l.to_date\n    FROM dept_emp d\n        INNER JOIN dept_emp_latest_date l\n        ON d.emp_no=l.emp_no AND d.from_date=l.from_date AND l.to_date = d.to_date')]

In [ ]:
%%sql
INSERT INTO `employees` VALUES (10001,'1953-09-02','Georgi','Facello','M','1986-06-26'),
(10002,'1964-06-02','Bezalel','Simmel','F','1985-11-21'),
(10003,'1959-12-03','Parto','Bamford','M','1986-08-28'),
(10004,'1954-05-01','Chirstian','Koblick','M','1986-12-01'),
(10005,'1955-01-21','Kyoichi','Maliniak','M','1989-09-12'),
(10006,'1953-04-20','Anneke','Preusig','F','1989-06-02'),
(10007,'1957-05-23','Tzvetan','Zielinski','F','1989-02-10'),
(10008,'1958-02-19','Saniya','Kalloufi','M','1994-09-15'),
(10009,'1952-04-19','Sumant','Peac','F','1985-02-18'),
(10010,'1963-06-01','Duangkaew','Piveteau','F','1989-08-24'),
(10011,'1953-11-07','Mary','Sluis','F','1990-01-22'),
(10012,'1960-10-04','Patricio','Bridgland','M','1992-12-18'),
(10013,'1963-06-07','Eberhardt','Terkki','M','1985-10-20'),
(10014,'1956-02-12','Berni','Genin','M','1987-03-11'),
(10015,'1959-08-19','Guoxiang','Nooteboom','M','1987-07-02'),
(10016,'1961-05-02','Kazuhito','Cappelletti','M','1995-01-27'),
(10017,'1958-07-06','Cristinel','Bouloucos','F','1993-08-03'),
(10018,'1954-06-19','Kazuhide','Peha','F','1987-04-03'),
(10019,'1953-01-23','Lillian','Haddadi','M','1999-04-30'),
(10020,'1952-12-24','Mayuko','Warwick','M','1991-01-26'),
(10021,'1960-02-20','Ramzi','Erde','M','1988-02-10'),
(10022,'1952-07-08','Shahaf','Famili','M','1995-08-22'),
(10023,'1953-09-29','Bojan','Montemayor','F','1989-12-17'),
(10024,'1958-09-05','Suzette','Pettey','F','1997-05-19'),
(10025,'1958-10-31','Prasadram','Heyers','M','1987-08-17'),
(10026,'1953-04-03','Yongqiao','Berztiss','M','1995-03-20'),
(10027,'1962-07-10','Divier','Reistad','F','1989-07-07'),
(10028,'1963-11-26','Domenick','Tempesti','M','1991-10-22'),
(10029,'1956-12-13','Otmar','Herbst','M','1985-11-20'),
(10030,'1958-07-14','Elvis','Demeyer','M','1994-02-17'),
(10031,'1959-01-27','Karsten','Joslin','M','1991-09-01'),
(10032,'1960-08-09','Jeong','Reistad','F','1990-06-20'),
(10033,'1956-11-14','Arif','Merlo','M','1987-03-18'),
(10034,'1962-12-29','Bader','Swan','M','1988-09-21'),
(10035,'1953-02-08','Alain','Chappelet','M','1988-09-05'),
(10036,'1959-08-10','Adamantios','Portugali','M','1992-01-03');

 * sqlite://
36 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM employees LIMIT 5;

 * sqlite://
Done.

[(10001, '1953-09-02', 'Georgi', 'Facello', 'M', '1986-06-26'),
 (10002, '1964-06-02', 'Bezalel', 'Simmel', 'F', '1985-11-21'),
 (10003, '1959-12-03', 'Parto', 'Bamford', 'M', '1986-08-28'),
 (10004, '1954-05-01', 'Chirstian', 'Koblick', 'M', '1986-12-01'),
 (10005, '1955-01-21', 'Kyoichi', 'Maliniak', 'M', '1989-09-12')]

In [ ]:
%%sql
INSERT INTO `dept_emp` VALUES (10001,'d005','1986-06-26','9999-01-01'),
(10002,'d007','1996-08-03','9999-01-01'),
(10003,'d004','1995-12-03','9999-01-01'),
(10004,'d004','1986-12-01','9999-01-01'),
(10005,'d003','1989-09-12','9999-01-01'),
(10006,'d005','1990-08-05','9999-01-01'),
(10007,'d008','1989-02-10','9999-01-01'),
(10008,'d005','1998-03-11','2000-07-31'),
(10009,'d006','1985-02-18','9999-01-01'),
(10010,'d004','1996-11-24','2000-06-26'),
(10010,'d006','2000-06-26','9999-01-01'),
(10011,'d009','1990-01-22','1996-11-09'),
(10012,'d005','1992-12-18','9999-01-01'),
(10013,'d003','1985-10-20','9999-01-01'),
(10014,'d005','1993-12-29','9999-01-01'),
(10015,'d008','1992-09-19','1993-08-22'),
(10016,'d007','1998-02-11','9999-01-01'),
(10017,'d001','1993-08-03','9999-01-01'),
(10018,'d004','1992-07-29','9999-01-01'),
(10018,'d005','1987-04-03','1992-07-29'),
(10019,'d008','1999-04-30','9999-01-01'),
(10020,'d004','1997-12-30','9999-01-01'),
(10021,'d005','1988-02-10','2002-07-15'),
(10022,'d005','1999-09-03','9999-01-01'),
(10023,'d005','1999-09-27','9999-01-01'),
(10024,'d004','1998-06-14','9999-01-01'),
(10025,'d005','1987-08-17','1997-10-15'),
(10026,'d004','1995-03-20','9999-01-01'),
(10027,'d005','1995-04-02','9999-01-01'),
(10028,'d005','1991-10-22','1998-04-06'),
(10029,'d004','1991-09-18','1999-07-08'),
(10029,'d006','1999-07-08','9999-01-01'),
(10030,'d004','1994-02-17','9999-01-01'),
(10031,'d005','1991-09-01','9999-01-01'),
(10032,'d004','1990-06-20','9999-01-01'),
(10033,'d006','1987-03-18','1993-03-24'),
(10034,'d007','1995-04-12','1999-10-31'),
(10035,'d004','1988-09-05','9999-01-01'),
(10036,'d003','1992-04-28','9999-01-01');

 * sqlite://
39 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM dept_emp LIMIT 5;

 * sqlite://
Done.

[(10001, 'd005', '1986-06-26', '9999-01-01'),
 (10002, 'd007', '1996-08-03', '9999-01-01'),
 (10003, 'd004', '1995-12-03', '9999-01-01'),
 (10004, 'd004', '1986-12-01', '9999-01-01'),
 (10005, 'd003', '1989-09-12', '9999-01-01')]

In [ ]:
%%sql
INSERT INTO `departments` VALUES
('d001','Marketing'),
('d002','Finance'),
('d003','Human Resources'),
('d004','Production'),
('d005','Development'),
('d006','Quality Management'),
('d007','Sales'),
('d008','Research'),
('d009','Customer Service');

 * sqlite://
9 rows affected.

[]

In [ ]:
%%sql
INSERT INTO `salaries` VALUES (10001,60117,'1986-06-26','1987-06-26'),
(10001,62102,'1987-06-26','1988-06-25'),
(10001,66074,'1988-06-25','1989-06-25'),
(10001,66596,'1989-06-25','1990-06-25'),
(10001,66961,'1990-06-25','1991-06-25'),
(10001,71046,'1991-06-25','1992-06-24'),
(10001,74333,'1992-06-24','1993-06-24'),
(10001,75286,'1993-06-24','1994-06-24'),
(10001,75994,'1994-06-24','1995-06-24'),
(10001,76884,'1995-06-24','1996-06-23'),
(10001,80013,'1996-06-23','1997-06-23'),
(10001,81025,'1997-06-23','1998-06-23'),
(10001,81097,'1998-06-23','1999-06-23'),
(10001,84917,'1999-06-23','2000-06-22'),
(10001,85112,'2000-06-22','2001-06-22'),
(10001,85097,'2001-06-22','2002-06-22'),
(10001,88958,'2002-06-22','9999-01-01'),
(10002,65828,'1996-08-03','1997-08-03'),
(10002,65909,'1997-08-03','1998-08-03'),
(10002,67534,'1998-08-03','1999-08-03'),
(10002,69366,'1999-08-03','2000-08-02'),
(10002,71963,'2000-08-02','2001-08-02'),
(10002,72527,'2001-08-02','9999-01-01'),
(10003,40006,'1995-12-03','1996-12-02'),
(10003,43616,'1996-12-02','1997-12-02'),
(10003,43466,'1997-12-02','1998-12-02'),
(10003,43636,'1998-12-02','1999-12-02'),
(10003,43478,'1999-12-02','2000-12-01'),
(10003,43699,'2000-12-01','2001-12-01'),
(10003,43311,'2001-12-01','9999-01-01'),
(10004,40054,'1986-12-01','1987-12-01'),
(10004,42283,'1987-12-01','1988-11-30'),
(10004,42542,'1988-11-30','1989-11-30'),
(10004,46065,'1989-11-30','1990-11-30'),
(10004,48271,'1990-11-30','1991-11-30'),
(10004,50594,'1991-11-30','1992-11-29'),
(10004,52119,'1992-11-29','1993-11-29'),
(10004,54693,'1993-11-29','1994-11-29'),
(10004,58326,'1994-11-29','1995-11-29'),
(10004,60770,'1995-11-29','1996-11-28'),
(10004,62566,'1996-11-28','1997-11-28'),
(10004,64340,'1997-11-28','1998-11-28'),
(10004,67096,'1998-11-28','1999-11-28'),
(10004,69722,'1999-11-28','2000-11-27'),
(10004,70698,'2000-11-27','2001-11-27'),
(10004,74057,'2001-11-27','9999-01-01'),
(10005,78228,'1989-09-12','1990-09-12'),
(10005,82621,'1990-09-12','1991-09-12'),
(10005,83735,'1991-09-12','1992-09-11'),
(10005,85572,'1992-09-11','1993-09-11'),
(10005,85076,'1993-09-11','1994-09-11'),
(10005,86050,'1994-09-11','1995-09-11'),
(10005,88448,'1995-09-11','1996-09-10'),
(10005,88063,'1996-09-10','1997-09-10'),
(10005,89724,'1997-09-10','1998-09-10'),
(10005,90392,'1998-09-10','1999-09-10'),
(10005,90531,'1999-09-10','2000-09-09'),
(10005,91453,'2000-09-09','2001-09-09'),
(10005,94692,'2001-09-09','9999-01-01'),
(10006,40000,'1990-08-05','1991-08-05'),
(10006,42085,'1991-08-05','1992-08-04'),
(10006,42629,'1992-08-04','1993-08-04'),
(10006,45844,'1993-08-04','1994-08-04'),
(10006,47518,'1994-08-04','1995-08-04'),
(10006,47917,'1995-08-04','1996-08-03'),
(10006,52255,'1996-08-03','1997-08-03'),
(10006,53747,'1997-08-03','1998-08-03'),
(10006,56032,'1998-08-03','1999-08-03'),
(10006,58299,'1999-08-03','2000-08-02'),
(10006,60098,'2000-08-02','2001-08-02'),
(10006,59755,'2001-08-02','9999-01-01'),
(10007,56724,'1989-02-10','1990-02-10'),
(10007,60740,'1990-02-10','1991-02-10'),
(10007,62745,'1991-02-10','1992-02-10'),
(10007,63475,'1992-02-10','1993-02-09'),
(10007,63208,'1993-02-09','1994-02-09'),
(10007,64563,'1994-02-09','1995-02-09'),
(10007,68833,'1995-02-09','1996-02-09'),
(10007,70220,'1996-02-09','1997-02-08'),
(10007,73362,'1997-02-08','1998-02-08'),
(10007,75582,'1998-02-08','1999-02-08'),
(10007,79513,'1999-02-08','2000-02-08'),
(10007,80083,'2000-02-08','2001-02-07'),
(10007,84456,'2001-02-07','2002-02-07'),
(10007,88070,'2002-02-07','9999-01-01'),
(10008,46671,'1998-03-11','1999-03-11'),
(10008,48584,'1999-03-11','2000-03-10'),
(10008,52668,'2000-03-10','2000-07-31'),
(10009,60929,'1985-02-18','1986-02-18'),
(10009,64604,'1986-02-18','1987-02-18'),
(10009,64780,'1987-02-18','1988-02-18'),
(10009,66302,'1988-02-18','1989-02-17'),
(10009,69042,'1989-02-17','1990-02-17'),
(10009,70889,'1990-02-17','1991-02-17'),
(10009,71434,'1991-02-17','1992-02-17'),
(10009,74612,'1992-02-17','1993-02-16'),
(10009,76518,'1993-02-16','1994-02-16'),
(10009,78335,'1994-02-16','1995-02-16'),
(10009,80944,'1995-02-16','1996-02-16'),
(10009,82507,'1996-02-16','1997-02-15'),
(10009,85875,'1997-02-15','1998-02-15'),
(10009,89324,'1998-02-15','1999-02-15'),
(10009,90668,'1999-02-15','2000-02-15'),
(10009,93507,'2000-02-15','2001-02-14'),
(10009,94443,'2001-02-14','2002-02-14'),
(10009,94409,'2002-02-14','9999-01-01'),
(10010,72488,'1996-11-24','1997-11-24'),
(10010,74347,'1997-11-24','1998-11-24'),
(10010,75405,'1998-11-24','1999-11-24'),
(10010,78194,'1999-11-24','2000-11-23'),
(10010,79580,'2000-11-23','2001-11-23'),
(10010,80324,'2001-11-23','9999-01-01'),
(10011,42365,'1990-01-22','1991-01-22'),
(10011,44200,'1991-01-22','1992-01-22'),
(10011,48214,'1992-01-22','1993-01-21'),
(10011,50927,'1993-01-21','1994-01-21'),
(10011,51470,'1994-01-21','1995-01-21'),
(10011,54545,'1995-01-21','1996-01-21'),
(10011,56753,'1996-01-21','1996-11-09'),
(10012,40000,'1992-12-18','1993-12-18'),
(10012,41867,'1993-12-18','1994-12-18'),
(10012,42318,'1994-12-18','1995-12-18'),
(10012,44195,'1995-12-18','1996-12-17'),
(10012,46460,'1996-12-17','1997-12-17'),
(10012,46485,'1997-12-17','1998-12-17'),
(10012,47364,'1998-12-17','1999-12-17'),
(10012,51122,'1999-12-17','2000-12-16'),
(10012,54794,'2000-12-16','2001-12-16'),
(10012,54423,'2001-12-16','9999-01-01'),
(10013,40000,'1985-10-20','1986-10-20'),
(10013,40623,'1986-10-20','1987-10-20'),
(10013,40561,'1987-10-20','1988-10-19'),
(10013,40306,'1988-10-19','1989-10-19'),
(10013,43569,'1989-10-19','1990-10-19'),
(10013,46305,'1990-10-19','1991-10-19'),
(10013,47118,'1991-10-19','1992-10-18'),
(10013,50351,'1992-10-18','1993-10-18'),
(10013,49887,'1993-10-18','1994-10-18'),
(10013,53957,'1994-10-18','1995-10-18'),
(10013,57590,'1995-10-18','1996-10-17'),
(10013,59228,'1996-10-17','1997-10-17'),
(10013,59571,'1997-10-17','1998-10-17'),
(10013,63274,'1998-10-17','1999-10-17'),
(10013,63352,'1999-10-17','2000-10-16'),
(10013,66744,'2000-10-16','2001-10-16'),
(10013,68901,'2001-10-16','9999-01-01'),
(10014,46168,'1993-12-29','1994-12-29'),
(10014,48242,'1994-12-29','1995-12-29'),
(10014,47921,'1995-12-29','1996-12-28'),
(10014,50715,'1996-12-28','1997-12-28'),
(10014,53228,'1997-12-28','1998-12-28'),
(10014,53962,'1998-12-28','1999-12-28'),
(10014,56937,'1999-12-28','2000-12-27'),
(10014,59142,'2000-12-27','2001-12-27'),
(10014,60598,'2001-12-27','9999-01-01'),
(10015,40000,'1992-09-19','1993-08-22'),
(10016,70889,'1998-02-11','1999-02-11'),
(10016,72946,'1999-02-11','2000-02-11'),
(10016,76826,'2000-02-11','2001-02-10'),
(10016,76381,'2001-02-10','2002-02-10'),
(10016,77935,'2002-02-10','9999-01-01'),
(10017,71380,'1993-08-03','1994-08-03'),
(10017,75538,'1994-08-03','1995-08-03'),
(10017,79510,'1995-08-03','1996-08-02'),
(10017,82163,'1996-08-02','1997-08-02'),
(10017,86157,'1997-08-02','1998-08-02'),
(10017,89619,'1998-08-02','1999-08-02'),
(10017,91985,'1999-08-02','2000-08-01'),
(10017,96122,'2000-08-01','2001-08-01'),
(10017,98522,'2001-08-01','2002-08-01'),
(10017,99651,'2002-08-01','9999-01-01'),
(10018,55881,'1987-04-03','1988-04-02'),
(10018,59206,'1988-04-02','1989-04-02'),
(10018,61361,'1989-04-02','1990-04-02'),
(10018,61648,'1990-04-02','1991-04-02'),
(10018,61217,'1991-04-02','1992-04-01'),
(10018,61244,'1992-04-01','1993-04-01'),
(10018,63286,'1993-04-01','1994-04-01'),
(10018,65739,'1994-04-01','1995-04-01'),
(10018,67519,'1995-04-01','1996-03-31'),
(10018,69276,'1996-03-31','1997-03-31'),
(10018,72585,'1997-03-31','1998-03-31'),
(10018,72804,'1998-03-31','1999-03-31'),
(10018,76957,'1999-03-31','2000-03-30'),
(10018,80305,'2000-03-30','2001-03-30'),
(10018,84541,'2001-03-30','2002-03-30'),
(10018,84672,'2002-03-30','9999-01-01'),
(10019,44276,'1999-04-30','2000-04-29'),
(10019,46946,'2000-04-29','2001-04-29'),
(10019,46775,'2001-04-29','2002-04-29'),
(10019,50032,'2002-04-29','9999-01-01'),
(10020,40000,'1997-12-30','1998-12-30'),
(10020,40647,'1998-12-30','1999-12-30'),
(10020,43800,'1999-12-30','2000-12-29'),
(10020,44927,'2000-12-29','2001-12-29'),
(10020,47017,'2001-12-29','9999-01-01'),
(10021,55025,'1988-02-10','1989-02-09'),
(10021,56399,'1989-02-09','1990-02-09'),
(10021,59700,'1990-02-09','1991-02-09'),
(10021,60851,'1991-02-09','1992-02-09'),
(10021,61117,'1992-02-09','1993-02-08'),
(10021,60708,'1993-02-08','1994-02-08'),
(10021,63514,'1994-02-08','1995-02-08'),
(10021,66249,'1995-02-08','1996-02-08'),
(10021,70570,'1996-02-08','1997-02-07'),
(10021,74759,'1997-02-07','1998-02-07'),
(10021,77519,'1998-02-07','1999-02-07'),
(10021,77237,'1999-02-07','2000-02-07'),
(10021,79631,'2000-02-07','2001-02-06'),
(10021,82295,'2001-02-06','2002-02-06'),
(10021,84169,'2002-02-06','2002-07-15'),
(10022,40000,'1999-09-03','2000-09-02'),
(10022,39935,'2000-09-02','2001-09-02'),
(10022,41348,'2001-09-02','9999-01-01'),
(10023,47883,'1999-09-27','2000-09-26'),
(10023,50319,'2000-09-26','2001-09-26'),
(10023,50113,'2001-09-26','9999-01-01'),
(10024,83733,'1998-06-14','1999-06-14'),
(10024,86715,'1999-06-14','2000-06-13'),
(10024,91067,'2000-06-13','2001-06-13'),
(10024,94701,'2001-06-13','2002-06-13'),
(10024,96646,'2002-06-13','9999-01-01'),
(10025,40000,'1987-08-17','1988-08-16'),
(10025,44416,'1988-08-16','1989-08-16'),
(10025,48680,'1989-08-16','1990-08-16'),
(10025,50120,'1990-08-16','1991-08-16'),
(10025,50980,'1991-08-16','1992-08-15'),
(10025,54459,'1992-08-15','1993-08-15'),
(10025,54395,'1993-08-15','1994-08-15'),
(10025,56643,'1994-08-15','1995-08-15'),
(10025,57585,'1995-08-15','1996-08-14'),
(10025,57110,'1996-08-14','1997-08-14'),
(10025,57157,'1997-08-14','1997-10-15'),
(10026,47585,'1995-03-20','1996-03-19'),
(10026,51730,'1996-03-19','1997-03-19'),
(10026,53682,'1997-03-19','1998-03-19'),
(10026,56769,'1998-03-19','1999-03-19'),
(10026,60397,'1999-03-19','2000-03-18'),
(10026,64132,'2000-03-18','2001-03-18'),
(10026,65415,'2001-03-18','2002-03-18'),
(10026,66313,'2002-03-18','9999-01-01'),
(10027,40000,'1995-04-02','1996-04-01'),
(10027,39520,'1996-04-01','1997-04-01'),
(10027,42382,'1997-04-01','1998-04-01'),
(10027,43654,'1998-04-01','1999-04-01'),
(10027,43925,'1999-04-01','2000-03-31'),
(10027,45157,'2000-03-31','2001-03-31'),
(10027,45771,'2001-03-31','2002-03-31'),
(10027,46145,'2002-03-31','9999-01-01'),
(10028,48859,'1991-10-22','1992-10-21'),
(10028,50805,'1992-10-21','1993-10-21'),
(10028,52082,'1993-10-21','1994-10-21'),
(10028,54949,'1994-10-21','1995-10-21'),
(10028,55963,'1995-10-21','1996-10-20'),
(10028,57831,'1996-10-20','1997-10-20'),
(10028,58502,'1997-10-20','1998-04-06'),
(10029,63163,'1991-09-18','1992-09-17'),
(10029,66877,'1992-09-17','1993-09-17'),
(10029,69211,'1993-09-17','1994-09-17'),
(10029,70624,'1994-09-17','1995-09-17'),
(10029,70294,'1995-09-17','1996-09-16'),
(10029,70671,'1996-09-16','1997-09-16'),
(10029,73510,'1997-09-16','1998-09-16'),
(10029,75773,'1998-09-16','1999-09-16'),
(10029,76067,'1999-09-16','2000-09-15'),
(10029,76608,'2000-09-15','2001-09-15'),
(10029,77777,'2001-09-15','9999-01-01'),
(10030,66956,'1994-02-17','1995-02-17'),
(10030,68393,'1995-02-17','1996-02-17'),
(10030,72795,'1996-02-17','1997-02-16'),
(10030,76453,'1997-02-16','1998-02-16'),
(10030,79290,'1998-02-16','1999-02-16'),
(10030,83327,'1999-02-16','2000-02-16'),
(10030,86634,'2000-02-16','2001-02-15'),
(10030,87027,'2001-02-15','2002-02-15'),
(10030,88806,'2002-02-15','9999-01-01'),
(10031,40000,'1991-09-01','1992-08-31'),
(10031,40859,'1992-08-31','1993-08-31'),
(10031,41881,'1993-08-31','1994-08-31'),
(10031,44191,'1994-08-31','1995-08-31'),
(10031,47202,'1995-08-31','1996-08-30'),
(10031,47606,'1996-08-30','1997-08-30'),
(10031,50810,'1997-08-30','1998-08-30'),
(10031,52675,'1998-08-30','1999-08-30'),
(10031,54177,'1999-08-30','2000-08-29'),
(10031,53873,'2000-08-29','2001-08-29'),
(10031,56689,'2001-08-29','9999-01-01'),
(10032,48426,'1990-06-20','1991-06-20'),
(10032,49389,'1991-06-20','1992-06-19'),
(10032,52000,'1992-06-19','1993-06-19'),
(10032,53038,'1993-06-19','1994-06-19'),
(10032,54336,'1994-06-19','1995-06-19'),
(10032,53978,'1995-06-19','1996-06-18'),
(10032,55090,'1996-06-18','1997-06-18'),
(10032,57110,'1997-06-18','1998-06-18'),
(10032,57926,'1998-06-18','1999-06-18'),
(10032,57876,'1999-06-18','2000-06-17'),
(10032,61709,'2000-06-17','2001-06-17'),
(10032,65820,'2001-06-17','2002-06-17'),
(10032,69539,'2002-06-17','9999-01-01'),
(10033,51258,'1987-03-18','1988-03-17'),
(10033,54972,'1988-03-17','1989-03-17'),
(10033,55410,'1989-03-17','1990-03-17'),
(10033,56095,'1990-03-17','1991-03-17'),
(10033,56038,'1991-03-17','1992-03-16'),
(10033,57712,'1992-03-16','1993-03-16'),
(10033,60433,'1993-03-16','1993-03-24'),
(10034,47561,'1995-04-12','1996-04-11'),
(10034,51192,'1996-04-11','1997-04-11'),
(10034,52687,'1997-04-11','1998-04-11'),
(10034,53112,'1998-04-11','1999-04-11'),
(10034,53164,'1999-04-11','1999-10-31'),
(10035,41538,'1988-09-05','1989-09-05'),
(10035,45131,'1989-09-05','1990-09-05'),
(10035,45629,'1990-09-05','1991-09-05'),
(10035,48360,'1991-09-05','1992-09-04'),
(10035,50664,'1992-09-04','1993-09-04'),
(10035,53060,'1993-09-04','1994-09-04'),
(10035,56640,'1994-09-04','1995-09-04'),
(10035,57621,'1995-09-04','1996-09-03'),
(10035,59291,'1996-09-03','1997-09-03'),
(10035,61793,'1997-09-03','1998-09-03'),
(10035,62285,'1998-09-03','1999-09-03'),
(10035,65332,'1999-09-03','2000-09-02'),
(10035,66584,'2000-09-02','2001-09-02'),
(10035,68755,'2001-09-02','9999-01-01'),
(10036,42819,'1992-04-28','1993-04-28'),
(10036,46756,'1993-04-28','1994-04-28'),
(10036,51084,'1994-04-28','1995-04-28'),
(10036,52308,'1995-04-28','1996-04-27'),
(10036,53828,'1996-04-27','1997-04-27'),
(10036,54408,'1997-04-27','1998-04-27'),
(10036,53929,'1998-04-27','1999-04-27'),
(10036,56579,'1999-04-27','2000-04-26'),
(10036,60478,'2000-04-26','2001-04-26'),
(10036,60520,'2001-04-26','2002-04-26'),
(10036,63053,'2002-04-26','9999-01-01');

 * sqlite://
337 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM salaries LIMIT 5;

 * sqlite://
Done.

[(10001, 60117, '1986-06-26', '1987-06-26'),
 (10001, 62102, '1987-06-26', '1988-06-25'),
 (10001, 66074, '1988-06-25', '1989-06-25'),
 (10001, 66596, '1989-06-25', '1990-06-25'),
 (10001, 66961, '1990-06-25', '1991-06-25')]

### Statistics

* https://www1.udel.edu/evelyn/SQL-Class3/SQL3_Stat.html
* https://www.statology.org/convert-z-scores-percentiles-excel/

In [ ]:
%%sql
SELECT salaries.emp_no, Count(*) AS Frequency
FROM salaries
GROUP BY salaries.emp_no
ORDER BY Count(*) DESC, emp_no LIMIT 5;

 * sqlite://
Done.

[(10009, 18), (10001, 17), (10013, 17), (10004, 16), (10018, 16)]

In [ ]:
%%sql
SELECT emp_no, Count(*) AS Frequency
FROM salaries
GROUP BY emp_no
HAVING Count(*) >= (
  SELECT Count(*)
  FROM salaries
  GROUP BY emp_no);

 * sqlite://
Done.

[(10001, 17), (10009, 18), (10013, 17)]

In [ ]:
%%sql
CREATE TEMPORARY TABLE temp_sal AS
  SELECT emp_no, MAX(salary) as salary
  FROM salaries
  GROUP BY emp_no;

 * sqlite://
Done.

[]

In [ ]:
%%sql
SELECT * FROM temp_sal LIMIT 5;

 * sqlite://
Done.

[(10001, 88958),
 (10002, 72527),
 (10003, 43699),
 (10004, 74057),
 (10005, 94692)]

In [ ]:
%%sql
SELECT s1.emp_no as EmpNo, Count(s1.emp_no) as Frequency, s1.salary
FROM temp_sal as s1
  INNER JOIN temp_sal as s2
  ON s1.salary >= s2.salary
GROUP BY s1.emp_no
ORDER BY s1.salary DESC
LIMIT 5;

 * sqlite://
Done.

[(10017, 36, 99651),
 (10024, 35, 96646),
 (10005, 34, 94692),
 (10009, 33, 94443),
 (10001, 32, 88958)]

In [ ]:
%%sql
SELECT Avg(salary) as MedianSalary FROM
  (SELECT s1.emp_no as EmpNo, Count(s1.emp_no) as Frequency, s1.salary
  FROM temp_sal as s1
    INNER JOIN temp_sal as s2
    ON s1.salary >= s2.salary
  GROUP BY s1.emp_no
  HAVING Count(s1.emp_no)
    BETWEEN (SELECT (Count(emp_no)/2)-0.5 FROM temp_sal)
    AND (SELECT (Count(emp_no)/2)+0.5 FROM temp_sal)
  ORDER BY s1.salary);

 * sqlite://
Done.

[(63053.0,)]

### Employees DB

* https://github.com/fracpete/employees-db-sqlite
* https://www3.ntu.edu.sg/home/ehchua/programming/sql/SampleDatabases.html
* https://dev.mysql.com/doc/employee/en/employees-installation.html
* https://github.com/datacharmer/test_db
* https://dev.mysql.com/doc/employee/en/sakila-structure.html

In [ ]:
!gunzip "/content/drive/MyDrive/INFO4080/employees_db-full-1.0.6.db.gz"

gzip: /content/drive/MyDrive/INFO4080/ is a directory -- ignored

In [ ]:
# mount drive
!gunzip "/content/drive/MyDrive/INFO4080/employees_db-full-1.0.6.db.gz" "/content/drive/MyDrive/INFO4080/"

In [ ]:
import sqlite3

connection = sqlite3.connect('/content/drive/MyDrive/INFO4080/employees_db-full-1.0.6.db')
cursor = connection.cursor()

In [ ]:
results = cursor.execute("SELECT * FROM salaries LIMIT 5").fetchall()
print([d[0] for d in cursor.description])
for record in results:
  print(record)

['emp_no', 'salary', 'from_date', 'to_date']
(10001, 60117, '1986-06-26', '1987-06-26')
(10001, 62102, '1987-06-26', '1988-06-25')
(10001, 66074, '1988-06-25', '1989-06-25')
(10001, 66596, '1989-06-25', '1990-06-25')
(10001, 66961, '1990-06-25', '1991-06-25')

### Normal Curve

* https://exceljet.net/functions/norm.s.dist-function
*

## LLM Fine Tuning

Sources:
* https://huggingface.co/docs/transformers/en/training
* https://youtu.be/OCNraV2Toa0?si=-0az6qyHlGLNdCTl
* https://youtu.be/g-_lw944edU?si=ZjZkEjEn_O0lEbry
* https://www.udemy.com/course/openai-python-api-bootcamp-learn-to-use-ai-gpt3-and-more

### Hugging Face

Setup
* Create account
* Create a new Space
* Select Docker... AutoTrain
* Get HF_Token
* Choose Public / Private

Get HF_Token
* Go to account
* Settings
* Access Tokens
* Create new token with Write
* Use for HF_Token in Space

AutoTrain
* Hardware
* Task
* Base Model (hardware must have enough space for that model)
* Training Data
* Column Mapping

Training Parameters

Terms
* https://huggingface.co/docs/trl/main/en/sft_trainer (supervised fine tuning)
* https://huggingface.co/docs/autotrain/en/llm_finetuning (check text format)
* https://huggingface.co/blog/pref-tuning
* https://huggingface.co/blog/rishiraj/finetune-llms

### WikiScrape Summarizer

The format might look like a list of dictionaries:

    [{"fulltext": "some prompt string","summary":"the best completed text option given the prompt"},]

In [ ]:
# import pandas as pd

# df = pd.read_csv('file.csv')

In [ ]:
# # create json format
# fulltext = df['txt']
# ft_format = [{"fulltext" : f, "summary": f} for f, s in zip(fulltext, summary)]

In [ ]:
# # example
# print(len(ft_format))
# ft_format[0]

In [ ]:
# # list to json
# import json

# training_data = json.dumps(ft_format, indent=2)

### Hugging Face AutoTrain

* For LLM SFT and Generic: csv file should have one column named text followed by the actual text rows
  * https://discuss.huggingface.co/t/autotrain-csv-data-format/63305
  * https://github.com/huggingface/autotrain-example-datasets/blob/main/alpaca1k.csv
  * https://huggingface.co/docs/autotrain/en/llm_finetuning
  * https://www.kdnuggets.com/how-to-use-hugging-face-autotrain-to-finetune-llms

## APA Research Paper

### Abstract Section

* ABSTRACT: The abstract needs to provide a brief but comprehensive summary of the contents of your paper.  It provides an overview of the paper and helps readers decide whether to read the full text. Limit your abstract to 250 words.
* https://apastyle.apa.org/instructional-aids/abstract-keywords-guide.pdf

### Introduction Section

* A good introduction will summarize, integrate, and critically evaluate the empirical knowledge in the relevant area(s) in a way that sets the stage for your study and why you conducted it. The introduction starts out broad (but not too broad!) and gets more focused toward the end.

Example Prompt:

My research question is To what extent and through what mechanisms does religion influence the formation and expression of ultra-nationalist ideologies and movements within Western civilization? I need to write an introduction to my research paper. Can you write an opening sentence that clearly conveys the relevance of the following text.

[text]

### Method Section

From Gemini

**Prompt**: I am writing a research paper and want to know what elements go in the method section

**Response**:

**Method**

The method section of your research paper is crucial, as it details how you conducted your research and allows readers to assess its validity and replicability. Here are the key elements you should include:

**1. Research Design:**

* https://library.cityu.edu/researchguides/researchmethods/litreview
* Briefly explain the type of research design you employed (e.g., experiment, survey, case study).
* Justify your choice of design and how it aligns with your research question and objectives.

**2. Participants or Subjects:**

* Describe the characteristics of your participants or subjects, including demographics, selection criteria, and sample size.
* Explain how you recruited participants and ensure ethical considerations were addressed (e.g., informed consent).

**3. Materials and Equipment:**

* List all the materials and equipment used in your research, including specific details like brand names, models, and software versions.
* Describe any specific procedures or preparations undertaken for the materials or equipment.

**4. Procedure:**

* Provide a step-by-step explanation of how you conducted your research, ensuring clarity and conciseness.
* Include details on data collection methods (e.g., surveys, interviews, observations) and any manipulations or interventions involved.
*  If applicable, describe the order of events and any control measures implemented.

**5. Data Analysis:**

* Explain how you analyzed your data, including the specific statistical tests or qualitative analysis methods used.
* Briefly justify your choice of analysis methods and their appropriateness for your research question and data type.

**Additional Considerations:**

* **Ethical Approval:** If your research involved human subjects or animals, mention the ethical approval process and the body that granted approval.
* **Data Management:** Briefly describe how you stored and managed your data throughout the research process.
* **Clarity and Conciseness:** Use clear and concise language, avoiding jargon and unnecessary details.
* **Logical Organization:**  Structure the section logically, often using subheadings to present information in a clear and organized manner.

Remember, the specific elements and level of detail required in your methods section may vary depending on your field of study and specific research question. It's always recommended to consult your research style guide or professor for specific formatting and content requirements.

### Results Section

The results section of a research paper is all about presenting the cold, hard facts unearthed by your research. It acts like a bridge between the methodology you used and what you ultimately discovered. Here are the key points to remember:

* **Focus on Findings:** It presents what you found, sticking to data and observations without interpretation or analysis. Think of it as laying out the evidence.
* **Answer the Question:** The findings should directly address the research question(s) you posed at the outset of the paper.
* **Logical Flow:** Organize your findings in a clear and logical sequence, often mirroring the structure of your methodology.
* **Data Presentation:** Use tables, figures, and charts to effectively showcase your findings. Text descriptions should complement these visuals.
* **Neutral Tone:** Avoid any bias or personal opinions in this section. Maintain a strictly objective and factual approach.
* **Context is Key:** Briefly introduce the results section by reminding the reader of the research problem and the purpose of your study.
* **Only Relevant Findings:** Include data directly connected to your research goals. Avoid cluttering the section with unnecessary details.

Remember, the results section sets the stage for the discussion section, where you'll delve deeper into interpreting the meaning of your findings.

The results section of a research paper is one of the most important parts, and it should only include the findings of the study. The results section should include:

* Data: Data presented in tables, charts, graphs, and other figures
* Contextual analysis: A sentence-based explanation of the meaning of the data
* Secondary findings: Secondary outcomes, subgroup analyses, and more
* Connection to research questions: How the data relates to the research questions

The results section should not attempt to interpret or analyze the findings, only state the facts. The data may be placed into the text or on separate pages at the end of the manuscript.

The results (or findings) section is one of the most important parts of a research paper, in which an author reports the findings of their study in connection to their research question(s). The results section should not attempt to interpret or analyze the findings, only state the facts.

The Results section should include the findings of your study and ONLY the findings of your study. The findings include: Data presented in tables, charts, graphs, and other figures (may be placed into the text or on separate pages at the end of the manuscript) A contextual analysis of this data explaining its meaning in sentence form. All data that corresponds to the central research question(s) All secondary findings (secondary outcomes, subgroup analyses, etc.)

### Discussion Section

* Prompt: Hi, I am writing a APA 7 research paper and want to know the key elements of the discussion section. Please also provide and outline of the APA 7 discussion section.

#### Key Elements of an APA 7 Discussion Section

The discussion section is the heart of your research paper. Here's what you should cover:

* **Interpretation of Findings:** Explain what your results mean in light of your research questions or hypotheses.  Discuss how your findings relate to existing research (mentioned in your literature review).
* **Acknowledge Unexpected Results:**  Address any findings that didn't support your hypotheses.  Discuss possible explanations for these results.
* **Limitations:** Discuss the weaknesses or limitations of your study.  How might these limitations have affected your results?
* **Implications:**  Explain the broader significance of your research.  What are the real-world implications of your findings?
* **Future Directions:**  Propose areas for future research based on your findings.  What questions remain unanswered?

####  Outline of an APA 7 Discussion Section

1. **Brief Re-state the Research Question/Hypothesis:**  Remind the reader of your research goals.
2. **Summarize Key Findings:** Briefly mention the main results of your study.
3. **Interpret Findings in Detail:**  Dive deeper into your results, explaining their meaning and how they relate to your research questions/hypotheses and the existing literature.
    * Discuss any unexpected findings and offer possible explanations.
4. **Limitations:** Acknowledge the weaknesses of your study and how they might have affected your results.
5. **Implications:**  Explain the broader significance of your research.  What are the real-world implications of your findings?
6. **Future Directions:**  Propose new research questions or areas for future investigation based on your findings.
7. **Conclusion:**   Briefly summarize the main points of your discussion and reiterate the significance of your research.

**Tips:**

* Use the present tense to discuss your findings.
*  Cite relevant sources throughout the discussion to support your interpretations.
* Maintain a formal and objective writing style.

### Bibliography / References

## PowerPoint Presentation

* https://docs.google.com/document/d/1onb_1KS8RCDc2McbCDp1IewIXg47uwi1URTgDZFcLQY/edit?usp=sharing

## Github Pages